<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>三年之痒 | 一路风景</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="09&amp;#x5E74;&amp;#x5F00;&amp;#x59CB;&amp;#x8BFB;&amp;#x7814;&amp;#xFF0C;&amp;#x4E4B;&amp;#x540E;&amp;#x5F00;&amp;#x59CB;&amp;#x5B66;&amp;#x4E60;&amp;#x7F16;&amp;#x7A0B;&amp;#xFF0C;&amp;#x5728;&amp;#x6821;&amp;#x671F;&amp;#x95F4;&amp;#x63A5;&amp;#x89E6;&amp;#x4E86;VC&amp;#x548C;C#&amp;#x8BED;&amp;#">
<meta property="og:type" content="article">
<meta property="og:title" content="三年之痒">
<meta property="og:url" content="http://yoursite.com/2016/02/01/三年之痒/index.html">
<meta property="og:site_name" content="一路风景">
<meta property="og:description" content="09&amp;#x5E74;&amp;#x5F00;&amp;#x59CB;&amp;#x8BFB;&amp;#x7814;&amp;#xFF0C;&amp;#x4E4B;&amp;#x540E;&amp;#x5F00;&amp;#x59CB;&amp;#x5B66;&amp;#x4E60;&amp;#x7F16;&amp;#x7A0B;&amp;#xFF0C;&amp;#x5728;&amp;#x6821;&amp;#x671F;&amp;#x95F4;&amp;#x63A5;&amp;#x89E6;&amp;#x4E86;VC&amp;#x548C;C#&amp;#x8BED;&amp;#">
<meta property="og:updated_time" content="2016-02-03T01:54:00.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="三年之痒">
<meta name="twitter:description" content="09&amp;#x5E74;&amp;#x5F00;&amp;#x59CB;&amp;#x8BFB;&amp;#x7814;&amp;#xFF0C;&amp;#x4E4B;&amp;#x540E;&amp;#x5F00;&amp;#x59CB;&amp;#x5B66;&amp;#x4E60;&amp;#x7F16;&amp;#x7A0B;&amp;#xFF0C;&amp;#x5728;&amp;#x6821;&amp;#x671F;&amp;#x95F4;&amp;#x63A5;&amp;#x89E6;&amp;#x4E86;VC&amp;#x548C;C#&amp;#x8BED;&amp;#">
  
    <link rel="alternative" href="/atom.xml" title="一路风景" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  <link rel="stylesheet" href="/css/style.css" type="text/css">
  

</head>
<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">一路风景</a>
      </h1>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="Search"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://yoursite.com"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-三年之痒" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2016/02/01/三年之痒/" class="article-date">
  <time datetime="2016-02-01T05:43:00.000Z" itemprop="datePublished">2016-02-01</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      三年之痒
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        

<p>
09&#x5E74;&#x5F00;&#x59CB;&#x8BFB;&#x7814;&#xFF0C;&#x4E4B;&#x540E;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#xFF0C;&#x5728;&#x6821;&#x671F;&#x95F4;&#x63A5;&#x89E6;&#x4E86;VC&#x548C;C#&#x8BED;&#x8A00;&#xFF0C;&#x5F00;&#x53D1;&#x7684;&#x9879;&#x76EE;&#x5747;&#x548C;&#x5DE5;&#x63A7;&#x9879;&#x76EE;&#x76F8;&#x5173;&#x3002;
12&#x5E74;4&#x6708;&#x4EFD;&#x6BD5;&#x4E1A;&#xFF0C;&#x8FDB;&#x5165;&#x4E86;&#x4E00;&#x5BB6;&#x592E;&#x4F01;&#xFF0C;&#x7EE7;&#x7EED;&#x4ECE;&#x4E8B;&#x5DE5;&#x63A7;&#x9886;&#x57DF;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#xFF0C;&#x5F00;&#x53D1;&#x5E73;&#x53F0;&#x6D89;&#x53CA;&#x5230;Linux&#x548C;windows&#xFF0C;&#x4F7F;&#x7528;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x57FA;&#x672C;&#x662F;C&#x548C;C++&#x3002;
&#x65F6;&#x81F3;&#x4ECA;&#x65E5;&#xFF0C;&#x57FA;&#x672C;&#x5B8C;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x975E;&#x8BA1;&#x7B97;&#x673A;&#x4E13;&#x4E1A;&#x6BD5;&#x4E1A;&#x751F;&#x5230;&#x8BA1;&#x7B97;&#x673A;&#x4E13;&#x4E1A;&#x9886;&#x57DF;&#x7684;&#x8F6C;&#x53D8;&#x3002;
&#x671F;&#x95F4;&#xFF0C;&#x6D89;&#x53CA;&#x5230;&#x4E86;&#x7F51;&#x7EDC;&#x7F16;&#x7A0B;&#xFF0C;UI&#x7F16;&#x7A0B;&#xFF0C;&#x591A;&#x7EBF;&#x7A0B;&#x7B49;&#x8F83;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x7F16;&#x7A0B;&#x6280;&#x672F;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x66F4;&#x6DF1;&#x5165;&#x4E86;&#x4E86;&#x89E3;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x5E95;&#x5C42;&#x6280;&#x672F;&#x7684;&#x5404;&#x4E2A;&#x65B9;&#x9762;&#x3002;
&#x6BD4;&#x5982;&#xFF0C;&#x7CFB;&#x7EDF;API&#x8C03;&#x7528;&#xFF0C;Linux&#x7CFB;&#x7EDF;&#x5B66;&#x4E60;&#xFF0C;&#x7F16;&#x8BD1;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#x548C;&#x4E00;&#x4E9B;&#x7B2C;&#x4E09;&#x65B9;&#x5E93;&#x7684;&#x4F7F;&#x7528;&#xFF08;ACE/BDB&#x7B49;&#xFF09;&#x3002;
</p>

<p>
&#x4F46;&#x662F;&#xFF0C;&#x603B;&#x7ED3;&#x5DE5;&#x4F5C;&#x7684;&#x8FD9;&#x4E09;&#x5E74;&#x65F6;&#x95F4;&#xFF1A;
&#x6280;&#x672F;&#x5C42;&#x9762;
          &#x6280;&#x672F;&#x4E0A;&#x867D;&#x7136;&#x6709;&#x8F83;&#x5927;&#x7684;&#x6210;&#x957F;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#x5B58;&#x5728;&#x95EE;&#x9898;&#xFF1A;
</p>

<ul class="org-ul">
<li>&#x7F3A;&#x5C11;&#x77E5;&#x8BC6;&#x548C;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x4EBA;&#x5E2E;&#x5E26;&#x3002;&#x7814;&#x53D1;&#x90E8;&#x95E8;&#x4E00;&#x76F4;&#x7F3A;&#x5C11;&#x4EBA;&#x624D;&#xFF0C;&#x5BF9;&#x4E8E;&#x5E94;&#x5C4A;&#x751F;&#x6765;&#x8BF4;&#xFF0C;&#x5176;&#x4E2A;&#x4EBA;&#x6210;&#x957F;&#x5B58;&#x5728;&#x4E00;&#x5B9A;&#x7684;&#x98CE;&#x9669;&#x3002;&#x8FD9;&#x4E09;&#x5E74;&#x4E2D;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x77E5;&#x8BC6;&#x7684;&#x79EF;&#x7D2F;&#x901A;&#x8FC7;&#x81EA;&#x8EAB;&#x7684;&#x5B66;&#x4E60;&#x548C;&#x6478;&#x7D22;&#xFF0C;&#x7F16;&#x7A0B;&#x65B9;&#x5F0F;&#x548C;&#x4E60;&#x60EF;&#x4E0A;&#x4E5F;&#x9760;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#x548C;&#x81EA;&#x6211;&#x7EA6;&#x675F;&#xFF0C;&#x65E0;&#x6CD5;&#x5BF9;&#x4E2A;&#x4EBA;&#x7684;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#x8FDB;&#x884C;&#x5224;&#x5B9A;&#xFF0C;&#x5982;&#x4F55;&#x505A;&#x624D;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x7ECF;&#x9A8C;&#x6027;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x65E0;&#x6CD5;&#x4ECE;&#x4E66;&#x672C;&#x548C;&#x7F51;&#x7EDC;&#x4E2D;&#x83B7;&#x53D6;&#x5230;&#x7684;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x9760;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#x3002;
</li>
<li>&#x6280;&#x672F;&#x6210;&#x957F;&#x7F13;&#x6162;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x81EA;&#x6211;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#x975E;&#x5E38;&#x5173;&#x952E;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x65B0;&#x6280;&#x80FD;&#xFF0C;&#x603B;&#x662F;&#x9700;&#x8981;&#x8D70;&#x5F88;&#x591A;&#x5F2F;&#x8DEF;&#xFF0C;&#x4E09;&#x5E74;&#x65F6;&#x95F4;&#x5185;&#xFF0C;&#x4E2A;&#x4EBA;&#x6210;&#x957F;&#x975E;&#x5E38;&#x7F13;&#x6162;&#x3002;
</li>
<li>&#x6D89;&#x53CA;&#x5230;&#x7684;&#x6280;&#x672F;&#x9648;&#x65E7;&#x3002;&#x8FD9;&#x4E2A;&#x4E0D;&#x662F;&#x501F;&#x53E3;&#x4E5F;&#x4E0D;&#x662F;&#x7406;&#x7531;&#xFF0C;&#x867D;&#x7136;&#x90FD;&#x80FD;&#x953B;&#x70BC;&#x7F16;&#x7A0B;&#x7684;&#x57FA;&#x672C;&#x529F;&#x5E95;&#xFF0C;&#x4F46;&#x73B0;&#x5728;&#x5E02;&#x573A;&#x7ECF;&#x6D4E;&#x4E0B;&#xFF0C;&#x4E0D;&#x80FD;&#x76F2;&#x76EE;&#x8DDF;&#x4ECE;&#xFF0C;&#x4F46;&#x4E5F;&#x8981;&#x77E5;&#x9053;&#x987A;&#x5E94;&#x5927;&#x52BF;&#xFF0C;&#x5BF9;&#x4E8E;&#x76EE;&#x524D;&#x7684;&#x5F00;&#x53D1;&#x6A21;&#x5F0F;&#x548C;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x5F00;&#x53D1;&#x6280;&#x672F;&#xFF0C;&#x5E02;&#x573A;&#x9700;&#x6C42;&#x4E0D;&#x5927;&#xFF0C;&#x5DF2;&#x662F;&#x5341;&#x5E74;&#x524D;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x5982;&#x4ECA;&#x4E5F;&#x6210;&#x4E3A;&#x975E;&#x4E3B;&#x6D41;&#x6280;&#x672F;&#x3002;&#x76EE;&#x524D;&#x7684;&#x9AD8;&#x85AA;&#x9886;&#x57DF;&#x548C;&#x4EBA;&#x624D;&#x9700;&#x6C42;&#x4E0E;&#x73B0;&#x4F7F;&#x7528;&#x7684;&#x6280;&#x672F;&#x65E0;&#x6CD5;&#x5339;&#x914D;&#x3002;
</li>
<li>&#x8FDD;&#x80CC;&#x4E2A;&#x4EBA;&#x89C4;&#x5212;&#x7684;&#x6280;&#x672F;&#x6210;&#x957F;&#x8DEF;&#x7EBF;&#x3002;&#x76EE;&#x524D;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x5DF2;&#x662F;&#x4E95;&#x5E95;&#x4E4B;&#x86D9;&#x3002;&#x653E;&#x5F03;&#x9AD8;&#x6548;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x548C;&#x6210;&#x719F;&#x7684;&#x6846;&#x67B6;&#x4E0D;&#x7528;&#xFF0C;&#x800C;&#x662F;&#x575A;&#x6301;&#x5DF2;&#x89C1;&#xFF0C;&#x5FC5;&#x7136;&#x88AB;&#x793E;&#x4F1A;&#x6DD8;&#x6C70;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E2A;&#x4EBA;&#x89C4;&#x5212;&#x7684;&#x6280;&#x672F;&#x6210;&#x957F;&#x8DEF;&#x7EBF;&#x5FC5;&#x987B;&#x5305;&#x542B;&#x6709;&#x6F5C;&#x529B;&#x7684;&#xFF0C;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x6280;&#x672F;&#x3002;
</li>
</ul>

<p>
&#x601D;&#x7EF4;&#x65B9;&#x5F0F;
</p>

<ul class="org-ul">
<li>&#x4E0D;&#x591F;&#x5F00;&#x653E;&#x3002;&#x5728;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x4E2D;&#xFF0C;&#x5F97;&#x4E0D;&#x5230;&#x63D0;&#x9AD8;&#xFF0C;&#x751A;&#x81F3;&#x6709;&#x79CD;&#x7981;&#x9522;&#x7684;&#x611F;&#x89C9;&#x3002;&#x5728;&#x7A0B;&#x5E8F;&#x5458;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x4E2D;&#xFF0C;&#x95ED;&#x95E8;&#x9020;&#x8F66;&#xFF0C;&#x4E0D;&#x6562;&#x8FC8;&#x51FA;&#x6B65;&#x5B50;&#x5BF9;&#x4EE5;&#x540E;&#x7684;&#x53D1;&#x5C55;&#x53CA;&#x5176;&#x4E0D;&#x5229;&#x3002;&#x5728;&#x4EE5;&#x540E;&#x7684;&#x5DE5;&#x4F5C;&#x4E2D;&#x5E94;&#x8BE5;&#x5C1D;&#x8BD5;&#x4ECE;&#x591A;&#x89D2;&#x5EA6;&#x53BB;&#x89C2;&#x5BDF;&#x8981;&#x5F00;&#x53D1;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x4ECE;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#x7684;&#x89D2;&#x5EA6;&#x3002;&#x5C1D;&#x8BD5;&#x81EA;&#x5DF1;&#x53BB;&#x4E86;&#x89E3;&#x5176;&#x4ED6;&#x89D2;&#x8272;&#x7684;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#xFF0C;&#x4ECE;&#x5927;&#x5C40;&#x548C;&#x5168;&#x5C40;&#x4E0A;&#x53BB;&#x5206;&#x6790;&#x548C;&#x8003;&#x8651;&#x95EE;&#x9898;&#x3002;
</li>
<li>&#x79EF;&#x6781;&#x6C9F;&#x901A;&#x3002;&#x6C9F;&#x901A;&#x7684;&#x5BF9;&#x8C61;&#x5404;&#x79CD;&#x5404;&#x6837;&#xFF0C;&#x4F46;&#x8981;&#x9488;&#x5BF9;&#x95EE;&#x9898;&#x53BB;&#x6C9F;&#x901A;&#xFF0C;&#x6452;&#x9664;&#x4E2A;&#x4EBA;&#x6F5C;&#x610F;&#x8BC6;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x6210;&#x89C1;&#xFF0C;&#x591A;&#x7AD9;&#x5728;&#x5BF9;&#x65B9;&#x7684;&#x89D2;&#x5EA6;&#x8003;&#x8651;&#x95EE;&#x9898;&#xFF0C;&#x63D0;&#x9AD8;&#x6C9F;&#x901A;&#x6548;&#x7387;&#x3002;&#x6C9F;&#x901A;&#x4E0D;&#x4EC5;&#x4EC5;&#x4F53;&#x73B0;&#x5728;&#x9762;&#x5BF9;&#x9762;&#x7684;&#x4EA4;&#x6D41;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x90AE;&#x4EF6;&#xFF0C;&#x535A;&#x5BA2;&#x4E0E;&#x76F8;&#x5173;&#x4EBA;&#x5458;&#x4EA4;&#x6D41;&#xFF0C;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#xFF0C;&#x5E2E;&#x52A9;&#x522B;&#x4EBA;&#x3002;
</li>
</ul>

<p>
&#x85AA;&#x8D44;&#x5F85;&#x9047;
</p>

<ul class="org-ul">
<li>&#x65E0;&#x589E;&#x957F;&#x3002;&#x4E09;&#x5E74;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5F85;&#x9047;&#x5374;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x63D0;&#x9AD8;&#xFF0C;&#x521A;&#x5165;&#x804C;&#x7684;&#x90A3;&#x4EFD;&#x671F;&#x671B;&#x65E0;&#x6CD5;&#x5F97;&#x5230;&#x5B9E;&#x73B0;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x6709;&#x66F4;&#x591A;&#x7684;&#x632B;&#x8D25;&#x611F;&#x3002;&#x751F;&#x6D3B;&#x538B;&#x529B;&#x968F;&#x7740;&#x679C;&#x679C;&#x7684;&#x5230;&#x6765;&#x4E5F;&#x9010;&#x6B65;&#x663E;&#x73B0;&#xFF0C;&#x73B0;&#x5B9E;&#x95EE;&#x9898;&#x4E0D;&#x5F97;&#x4E0D;&#x9762;&#x5BF9;&#x3002;
</li>
<li>&#x4E0D;&#x5408;&#x7406;&#x7684;&#x85AA;&#x8D44;&#x65B9;&#x6848;&#x3002;&#x80FD;&#x529B;&#x4E0E;&#x85AA;&#x8D44;&#x4E0D;&#x6210;&#x6B63;&#x6BD4;&#xFF0C;&#x751A;&#x81F3;&#x6210;&#x957F;&#x7A7A;&#x95F4;&#x51E0;&#x4E4E;&#x4E3A;&#x96F6;&#xFF0C;&#x4EE4;&#x4EBA;&#x5931;&#x671B;&#x3002;
</li>
</ul>

<p>
&#x90E8;&#x95E8;&#x7BA1;&#x7406;
</p>

<ul class="org-ul">
<li>&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#x4F4E;&#x6548;&#x3002;&#x5C3D;&#x7BA1;&#x9879;&#x76EE;&#x4E2D;&#x8981;&#x6C42;&#x4E25;&#x683C;&#x7684;&#x5BA1;&#x6838;&#x6D41;&#x7A0B;&#xFF0C;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x4EA7;&#x54C1;&#x8D28;&#x91CF;&#x548C;&#x751F;&#x4EA7;&#x6548;&#x7387;&#xFF0C;&#x4F46;&#x4E8B;&#x5B9E;&#x4E0A;&#x4E00;&#x5207;&#x89C4;&#x5B9A;&#x90FD;&#x6210;&#x4E3A;&#x4E00;&#x7EB8;&#x7A7A;&#x6587;&#xFF0C;&#x751A;&#x81F3;&#x6CA1;&#x6709;&#x80FD;&#x529B;&#x8FD0;&#x7528;&#x597D;&#x8FD9;&#x4E9B;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#x3002;
</li>
<li>&#x56E2;&#x961F;&#x5EFA;&#x8BBE;&#x6DF7;&#x4E71;&#x3002;&#x90E8;&#x95E8;&#x9886;&#x5BFC;&#x5DE5;&#x4F5C;&#x5B89;&#x6392;&#x6781;&#x4E3A;&#x4E0D;&#x534F;&#x8C03;&#xFF0C;&#x5BFC;&#x81F4;&#x5458;&#x5DE5;&#x6BEB;&#x65E0;&#x5934;&#x7EEA;&#xFF0C;&#x4E0D;&#x77E5;&#x8BE5;&#x5982;&#x4F55;&#x5B89;&#x6392;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x6DF7;&#x4E71;&#xFF0C;&#x9879;&#x76EE;&#x6210;&#x5458;&#x4EBA;&#x5FC3;&#x6DA3;&#x6563;&#x3002;
</li>
<li>&#x4EBA;&#x529B;&#x8D44;&#x6E90;&#x4E0D;&#x8DB3;&#x3002;&#x7F3A;&#x5C11;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5BFC;&#x81F4;&#x6BCF;&#x4E2A;&#x4EBA;&#x627F;&#x62C5;&#x4E86;&#x8FC7;&#x591A;&#x7684;&#x5F00;&#x53D1;&#x4EFB;&#x52A1;&#xFF0C;&#x4E3A;&#x4E86;&#x76F2;&#x76EE;&#x8FFD;&#x6C42;&#x65F6;&#x95F4;&#x8FDB;&#x5EA6;&#xFF0C;&#x4E0D;&#x5F97;&#x5DF2;&#x727A;&#x7272;&#x4EA7;&#x54C1;&#x529F;&#x80FD;&#x6216;&#x8005;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x3002;&#x9891;&#x7E41;&#x5207;&#x6362;&#x4E8E;&#x5404;&#x4E2A;&#x9879;&#x76EE;&#x4E4B;&#x95F4;&#xFF0C;&#x5BFC;&#x81F4;&#x6BCF;&#x9879;&#x5F00;&#x53D1;&#x4EFB;&#x52A1;&#x90FD;&#x5B58;&#x5728;&#x7455;&#x75B5;&#x3002;
</li>
<li>&#x9886;&#x5BFC;&#x7BA1;&#x7406;&#x65B9;&#x5F0F;&#x3002;&#x5728;&#x8FD9;&#x4E48;&#x6781;&#x7AEF;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x4E86;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x9886;&#x5BFC;&#x4ECD;&#x7136;&#x505A;&#x51FA;&#x62CD;&#x8111;&#x95E8;&#x7684;&#x51B3;&#x5B9A;&#x3002;&#x5BF9;&#x4E8E;&#x8F6F;&#x4EF6;&#x6280;&#x672F;&#x7F3A;&#x4E4F;&#x4E86;&#x89E3;&#x7684;&#x9886;&#x5BFC;&#xFF0C;&#x76F4;&#x63A5;&#x7BA1;&#x7406;&#x5404;&#x4E2A;&#x9879;&#x76EE;&#x6210;&#x5458;&#xFF0C;&#x4E0D;&#x4EC5;&#x8D8A;&#x754C;&#xFF0C;&#x66F4;&#x662F;&#x65F6;&#x523B;&#x7834;&#x574F;&#x4E86;&#x539F;&#x6709;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x7684;&#x8BA1;&#x5212;&#x548C;&#x5B89;&#x6392;&#x3002;
</li>
<li>&#x5458;&#x5DE5;&#x6267;&#x884C;&#x529B;&#x4E0D;&#x8DB3;&#x3002;&#x7814;&#x53D1;&#x6C1B;&#x56F4;&#x8D8A;&#x6765;&#x8D8A;&#x4E0D;&#x4E50;&#x89C2;&#xFF0C;&#x4EBA;&#x5458;&#x6D41;&#x5931;&#x4E25;&#x91CD;&#xFF0C;&#x9752;&#x9EC4;&#x4E0D;&#x63A5;&#xFF0C;&#x4E00;&#x4EBA;&#x627F;&#x62C5;&#x591A;&#x9879;&#x4EFB;&#x52A1;&#xFF0C;&#x5BFC;&#x81F4;&#x5458;&#x5DE5;&#x5FC3;&#x6001;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x5E94;&#x4ED8;&#x6001;&#x5EA6;&#x9010;&#x6E10;&#x6D6E;&#x73B0;&#x3002;
</li>
<li>&#x5458;&#x5DE5;&#x6C34;&#x5E73;&#x53C2;&#x5DEE;&#x4E0D;&#x9F50;&#x3002;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x7F3A;&#x5C11;&#x57F9;&#x517B;&#x5236;&#x5EA6;&#x3002;&#x4EBA;&#x624D;&#x7684;&#x57F9;&#x517B;&#x5E94;&#x8BE5;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x8F83;&#x9AD8;&#x7684;&#x5C42;&#x6B21;&#x53BB;&#x8003;&#x8651;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6BCF;&#x5E74;&#x5B9A;&#x51E0;&#x4E2A;&#x57F9;&#x8BAD;&#x8BA1;&#x5212;&#xFF0C;&#x5373;&#x4FBF;&#x8FD9;&#x4E9B;&#x8BA1;&#x5212;&#x90FD;&#x65E0;&#x6CD5;&#x5B8C;&#x6210;&#x3002;
</li>
</ul>

<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-02-01 Mon 13:43&gt;</span></span></p>
<p class="author">Author: QINSIMON</p>
<p class="date">Created: 2016-02-03 Wed 09:54</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/" target="_blank" rel="external">Emacs</a> 24.5.1 (<a href="http://orgmode.org" target="_blank" rel="external">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer" target="_blank" rel="external">Validate</a></p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2016/02/01/三年之痒/" data-id="cik66lee300008jwporfuw8mp" class="article-share-link">Share</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/viewpoint/">viewpoint</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/02/01/源码阅读心得/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          源码阅读心得
        
      </div>
    </a>
  
  
    <a href="/2015/11/08/start/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">新的开始</div>
    </a>
  
</nav>

  
</article>

</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Categories</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/编程语言/">编程语言</a><span class="category-list-count">2</span></li></ul>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tags</h3>
    <div class="widget">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/clojure/">clojure</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/code/">code</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/viewpoint/">viewpoint</a><span class="tag-list-count">1</span></li></ul>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tag Cloud</h3>
    <div class="widget tagcloud">
      <a href="/tags/clojure/" style="font-size: 20px;">clojure</a> <a href="/tags/code/" style="font-size: 10px;">code</a> <a href="/tags/viewpoint/" style="font-size: 10px;">viewpoint</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Archives</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/02/">February 2016</a><span class="archive-list-count">4</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/11/">November 2015</a><span class="archive-list-count">1</span></li></ul>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Recents</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2016/02/03/clojure初探/">clojure初探</a>
          </li>
        
          <li>
            <a href="/2016/02/03/clojure函数学习/">clojure函数学习</a>
          </li>
        
          <li>
            <a href="/2016/02/01/源码阅读心得/">源码阅读心得</a>
          </li>
        
          <li>
            <a href="/2016/02/01/三年之痒/">三年之痒</a>
          </li>
        
          <li>
            <a href="/2015/11/08/start/">新的开始</a>
          </li>
        
      </ul>
    </div>
  </div>

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2016 SSQ<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css" type="text/css">
  <script src="/fancybox/jquery.fancybox.pack.js" type="text/javascript"></script>


<script src="/js/script.js" type="text/javascript"></script>

  </div>
</body>
</html>